CSI API ETABS v1
cDesignShearWall Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDesignShearWall
Public Interface cDesignShearWall
Dim instance As cDesignShearWall
public interface class cDesignShearWall
type cDesignShearWall =  interface end
The cDesignShearWall type exposes the following members.
Methods
Name | Description
GetPierSummaryResults
GetRebar
GetRebarPrefsPier
 Retrieves data from the Rebar Selection Rules for Wall Piers
GetRebarPrefsSpandrel
 Retrieves data from the Rebar Selection Rules for Wall Spandrels
GetSpandrelSummaryResults
SetComboStrength
Top
See Also
Reference
ETABSv1 Namespace